jmeter/prod/SQL_load_delete_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">F:\apache-jmeter-5.3\lib\mssql-jdbc-8.4.1.jre11.jar,F:\apache-jmeter-5.3\lib\mssql-jdbc-8.4.1.jre14.jar,F:\apache-jmeter-5.3\lib\mssql-jdbc-8.4.1.jre8.jar</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">250</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="user1" elementType="Argument">
              <stringProp name="Argument.name">user1</stringProp>
              <stringProp name="Argument.value">user1</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user2" elementType="Argument">
              <stringProp name="Argument.name">user2</stringProp>
              <stringProp name="Argument.value">user2</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user3" elementType="Argument">
              <stringProp name="Argument.name">user3</stringProp>
              <stringProp name="Argument.value">user3</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user4" elementType="Argument">
              <stringProp name="Argument.name">user4</stringProp>
              <stringProp name="Argument.value">user4</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user5" elementType="Argument">
              <stringProp name="Argument.name">user5</stringProp>
              <stringProp name="Argument.value">user5</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user6" elementType="Argument">
              <stringProp name="Argument.name">user6</stringProp>
              <stringProp name="Argument.value">user6</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user7" elementType="Argument">
              <stringProp name="Argument.name">user7</stringProp>
              <stringProp name="Argument.value">user7</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user8" elementType="Argument">
              <stringProp name="Argument.name">user8</stringProp>
              <stringProp name="Argument.value">user8</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user9" elementType="Argument">
              <stringProp name="Argument.name">user9</stringProp>
              <stringProp name="Argument.value">user9</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="user10" elementType="Argument">
              <stringProp name="Argument.name">user10</stringProp>
              <stringProp name="Argument.value">user10</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration 0" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">Test_Pool_0</stringProp>
          <stringProp name="dbUrl">jdbc:sqlserver://10.142.0.2:1433;DatabaseName=mybank;</stringProp>
          <stringProp name="driver">com.microsoft.sqlserver.jdbc.SQLServerDriver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">GaarGaar1234</stringProp>
          <stringProp name="poolMax">1000</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">SA</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration 1" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">Test_Pool_1</stringProp>
          <stringProp name="dbUrl">jdbc:sqlserver://10.142.0.3:1433;DatabaseName=mybank;</stringProp>
          <stringProp name="driver">com.microsoft.sqlserver.jdbc.SQLServerDriver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">GaarGaar1234</stringProp>
          <stringProp name="poolMax">1000</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">SA</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration 2" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">Test_Pool_2</stringProp>
          <stringProp name="dbUrl">jdbc:sqlserver://10.142.0.4:1433;DatabaseName=mybank;</stringProp>
          <stringProp name="driver">com.microsoft.sqlserver.jdbc.SQLServerDriver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">GaarGaar1234</stringProp>
          <stringProp name="poolMax">1000</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">SA</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration 3" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">Test_Pool_3</stringProp>
          <stringProp name="dbUrl">jdbc:sqlserver://10.142.0.5:1433;DatabaseName=mybank;</stringProp>
          <stringProp name="driver">com.microsoft.sqlserver.jdbc.SQLServerDriver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">GaarGaar1234</stringProp>
          <stringProp name="poolMax">1000</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">SA</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <RandomOrderController guiclass="RandomOrderControllerGui" testclass="RandomOrderController" testname="Random Order Controller" enabled="true"/>
        <hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request 0" enabled="true">
            <stringProp name="dataSource">Test_Pool_0</stringProp>
            <stringProp name="query">EXEC sys.sp_set_session_context @key = N&apos;application_time&apos;, @value = &apos;${__time(yyy-MM-dd HH:mm:ss.SSS,)}&apos;;
EXEC sys.sp_set_session_context @key = N&apos;application_user&apos;, @value = &apos;${__V(user${__Random(1,10,)})}&apos;;

declare @id_borrar int
select @id_borrar = min(id) from transacciones
if @id_borrar &gt; 0
delete transacciones where id = @id_borrar
</stringProp>
            <stringProp name="queryType">Callable Statement</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request 1" enabled="true">
            <stringProp name="dataSource">Test_Pool_1</stringProp>
            <stringProp name="query">EXEC sys.sp_set_session_context @key = N&apos;application_time&apos;, @value = &apos;${__time(yyy-MM-dd HH:mm:ss.SSS,)}&apos;;
EXEC sys.sp_set_session_context @key = N&apos;application_user&apos;, @value = &apos;${__V(user${__Random(1,10,)})}&apos;;

declare @id_borrar int
select @id_borrar = min(id) from transacciones
if @id_borrar &gt; 0
delete transacciones where id = @id_borrar
</stringProp>
            <stringProp name="queryType">Callable Statement</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request 2" enabled="true">
            <stringProp name="dataSource">Test_Pool_2</stringProp>
            <stringProp name="query">EXEC sys.sp_set_session_context @key = N&apos;application_time&apos;, @value = &apos;${__time(yyy-MM-dd HH:mm:ss.SSS,)}&apos;;
EXEC sys.sp_set_session_context @key = N&apos;application_user&apos;, @value = &apos;${__V(user${__Random(1,10,)})}&apos;;

declare @id_borrar int
select @id_borrar = min(id) from transacciones
if @id_borrar &gt; 0
delete transacciones where id = @id_borrar
</stringProp>
            <stringProp name="queryType">Callable Statement</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request 3" enabled="true">
            <stringProp name="dataSource">Test_Pool_3</stringProp>
            <stringProp name="query">EXEC sys.sp_set_session_context @key = N&apos;application_time&apos;, @value = &apos;${__time(yyy-MM-dd HH:mm:ss.SSS,)}&apos;;
EXEC sys.sp_set_session_context @key = N&apos;application_user&apos;, @value = &apos;${__V(user${__Random(1,10,)})}&apos;;

declare @id_borrar int
select @id_borrar = min(id) from transacciones
if @id_borrar &gt; 0
delete transacciones where id = @id_borrar
</stringProp>
            <stringProp name="queryType">Callable Statement</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>